function getAllEood() {
	alert('Вашето устройство ще генерира 6 документа'); 
	getProtocolDoc('#EOOD'); 
	getFoundingActDoc('#EOOD'); 
	getSample141('#EOOD'); 
	getDeclaration13('#EOOD'); 
	getDeclaration141('#EOOD'); 
	getDeclaration142('#EOOD'); 
}

function getDeclaration13(formSelector) {
    var input = objectifyForm(formSelector); 
    var docDefinition = {
        content: [
        {
            text: `ДЕКЛАРАЦИЯ\r\n\r\nпо чл. 13, ал. 4 от Закона за Търговския Регистър\r\n\r\n\r\n`,
            style: 'title'
        },
        `\u200B\t\t\t\tДолуподписаният, ${input.first_name} ${input.middle_name} ${input.last_name} с ЕГН ${input.pin_egn} , притежаващ л.к. № ${input.user_id_number} , издадена на ${input.card_issue_date} от МВР ${input.card_issuer_city} , декларирам истинността на заявените от мен обстоятелства и приемането на представените за обявяване актове.\r\n`,
		`\r\n`,
		`\r\n`,
 		`\u200BИзвестна ми е наказателната отговорност, която нося по чл. 313 от Наказателния Кодекс, за декларирането на неверни данни.\r\n\r\n`,
		`\u200B\r\nДата: ${input.date_of_document} г.                                                                              ДЕКЛАРАТОР:......................................`,
		`\u200B\                                                                                                                                                     /Подпис/`,
        ]
    }; 

    makePDF(docDefinition,"BGDok-ЕООД-Декларация-по-чл13-ал4-ЗТР"); 

}

function getDeclaration141(formSelector) {
    var input = objectifyForm(formSelector); 
    var docDefinition = {
        content: [
        {
            text: `Декларация за липса на обстоятелствата по чл. 141, ал. 8\r\n\r\n\r\n`,
            style: 'title'
        },
		`\u200BДолуподписаният : ${input.first_name} ${input.middle_name} ${input.last_name} , ЕГН ${input.pin_egn} , и лична карта  № ${input.user_id_number} , издадена на  ${input.card_issue_date} г. от МВР ${input.card_issuer_city} с постоянен адрес - област ${input.user_address_city} , община ${input.user_address_municipality} , гр. ${input.user_address_city}, ул ${input.user_address_street} , номер ${input.user_address_street_number} , ет. ${input.user_address_floor} , ап. ${input.user_address_apartment}\r\n\r\n`,
        {
            text: `ДЕКЛАРИРАМ ЧЕ:\r\n\r\n\r\n`,
            style: 'title'
        },
		`\u200B1. Не съм обявен в несъстоятелност, както и че не съм бил управител, член на управителен или контролен орган на дружество, прекратено поради несъстоятелност през последните две години, предхождащи датата на решението за обявяване на несъстоятелността, ако са останали неудовлетворени кредитори.\r\n\r\n`,
		`\u200B2. Не съм бил управител, член на управителен или контролен орган на дружество, за което е било установено с влязло в сила наказателно постановление неизпълнение на задължения по създаване и съхраняване на определените му нива от запаси по Закона за запасите от нефт и нефтопродукти.\r\n\r\n\r\n\r\n`,
		`\u200BИзвестно ми е, че за даване на неверни данни нося наказателна отговорност по чл.313 от Наказателния кодекс.\r\n\r\n\r\n`,
		`\u200BГр. ${input.city_of_document}`,
		`\u200BДата: ${input.date_of_document}                             ДЕКЛАРАТОР: /…………………………………………/ (............................................................)`,
		`\u200B                                                                                                         /Подпис/                           /Име и фамилия/`,
        ]
    }; 

    makePDF(docDefinition,"BGDok-ЕООД-Декларация-за-липса-на-обстоятелствата-по-чл141-ал8"); 

}

function getDeclaration142(formSelector) {
    var input = objectifyForm(formSelector); 
    var docDefinition = {
        content: [
        {
            text: `ДЕКЛАРАЦИЯ\r\n\r\nпо чл. 142 от ТЗ\r\nот ${input.first_name} ${input.middle_name} ${input.last_name} в качеството ми на управител на\r\n${input.company_name} ЕООД\r\n\r\n`,
            style: 'title'
        },
		`\u200BДолуодписаният ${input.first_name} ${input.middle_name} ${input.last_name}, ЕГН ${input.pin_egn}, лична карта номер ${input.user_id_number} изд. от МВР гр. ${input.card_issuer_city} на ${input.card_issue_date} г., живущ в гр. ${input.user_address_city}, ул. ${input.user_address_street} ${input.user_address_street_number} , ет. ${input.user_address_floor} , ап. ${input.user_address_apartment}\r\n\r\n`,
		`\u200BДЕКЛАРИРАМ:\r\n`,
		`\u200BЧе в качеството ми на управител на ${input.company_name} ЕООД без съгласието на едноличния собственик на капитала няма:\r\n`,
		`\u200B1. от свое или от чуждо име да извършвам търговски сделки;\r\n`,
		`\u200B2. да участвувам в събирателни и командитни дружества и в дружества с ограничена отговорност;\r\n`,
		`\u200B3. да заемам длъжност в ръководни органи на други дружества.\r\n\r\n\r\n`,
		`\u200BДЕКЛАРАТОР:............................................................................/.............................................../`,
		`\u200B                                               /Име и фамилия/                                                /Подпис/`,
        ]
    }; 

    makePDF(docDefinition,"BGDok-ЕООД-Декларация-по-чл142-от-ТЗ"); 

}

function getFoundingActDoc(formSelector) {
    var input = objectifyForm(formSelector); 
    var docDefinition = {
        content: [
        {
            text: `УЧРЕДИТЕЛЕН АКТ\r\n\r\nНА ЕДНОЛИЧНО ДРУЖЕСТВО С ОГРАНИЧЕНА ОТГОВОРНОСТ\r\n \ " ${input.company_name} " \ ЕООД\r\n\r\n`,
            style: 'title'
        },
		`\u200BI. ОБЩИ ПОЛОЖЕНИЯ\r\n`,
		`\u200BПравен статут\r\n`,
		`\u200BЧл.1.(1). Настоящият учредителен акт е приет на ${input.date_of_document} в гр. ${input.city_of_document} от ${input.first_name} ${input.middle_name} ${input.last_name}, с ЕГН: ${input.pin_egn}, Лична карта номер: ${input.user_id_number} , Адрес: ${input.user_address_city}, ул. ${input.user_address_street} ${input.user_address_street_number} , ет. ${input.user_address_floor} , ап. ${input.user_address_apartment} , наричан за по-кратко Едноличен собственик на капитала.\r\n`,
		`\u200B(2) Дружеството е самостоятелно юридическо лице.\n`,
		`\u200B(3) Дружеството не отговаря за задълженията на Едноличния собственик на капитала.\n`,
		`\u200B(4) Отговорността на Едноличния собственик на капитала за задълженията на дружеството е ограничена до размера на дружествения капитал.\n`,
		`\u200BНаименование\r\n`,
		`\u200BЧл.2.(1) Името на дружеството е "${input.company_name}" ЕООД изписано на латиница като "${input.company_name_latin}".\r\n`,
		`\u200B(2) Името на дружеството трябва да се посочва във всички документи на дружеството.\r\n`,
		`\u200BСедалище и адрес на управление\r\n`,
		`\u200BЧл.3. Седалището и адресът на управление на дружеството е ${input.company_address_city} , ${input.company_address_street} , ${input.company_address_street_number} \r\n`,
		`\u200BСрок\r\n`,
		`\u200BЧл.4. Съществуването на Дружеството не е ограничено със срок.\r\n`,
		`\u200BПредмет на дейност\r\n`,
		`\u200BЧл.5. Дружеството има за предмет на дейност: ${input.company_purpose} .\r\n`,
		`\u200BЧл.6. Предметът на дейност на дружеството може да бъде разширяван, изменян и допълван по решение на Едноличния собственик на капитала.\r\n`,
		`\u200B\r\n`,
		`\u200BII. КАПИТАЛ\r\n`,
		`\u200BЧл.7. Капиталът на дружеството е ${input.company_capital} /${input.company_capital_text}/ лева.\r\n`,
		`\u200BДялове\r\n`,
		`\u200BЧл.8.(1) Дружественият капитал е разпределен на ${input.company_share_count} ( ${input.company_share_count_text} ) дяла, всеки с номинална стойност ${input.company_share_cost} ( ${input.company_share_cost_text} ) лева. Капиталът се притежава изцяло от Едноличния собственик.\r\n`,
     		`\u200B(2) Към момента на първоначалната регистрация, в дружеството са внесени ${input.company_share_banked} / ${input.company_share_banked_text} / дяла (${input.company_capital_banked_percentage} % от капитала) в размер на ${input.company_capital_banked} / ${input.company_capital_banked_text} / лв.\r\n`,
		`\u200B\r\n`,
		`\u200BIІІ. ИЗМЕНЕНИЕ НА УЧРЕДИТЕЛНИЯ АКТ\r\n`,
		`\u200BУвеличаване на капитала\r\n`,
		`\u200BЧл.9. Капиталът може да бъде увеличен по решение на Едноличния собственик на капитала чрез:\r\n`,
		`\u200B1. увеличаване номиналната стойност на дяловете; \r\n`,
		`\u200B2. записване на нови дялове;\r\n`,
		`\u200BНамаляване на капитала\r\n`,
		`\u200BЧл.10. Намаляване на капитала до предвидения в закона минимум може да се извърши чрез намаляване на номиналната стойност на дяловете в капитала. \r\n`,
		`\u200BІV. УПРАВЛЕНИЕ НА ДРУЖЕСТВОТО\r\n`,
		`\u200BЧл.11. Органи на управление на дружеството са Едноличния собственик на капитала и Управителят.\r\n`,
		`\u200BЕдноличен собственик на капитала\r\n`,
		`\u200BЧл.12. Едноличният собственик на капитала:\r\n`,
		`\u200B1. изменя и допълва Учредителния акт; \r\n`,
		`\u200B2. приема годишния отчет и баланса и разпределя печалбата; \r\n`,
		`\u200B3. взема решение за намаляване и увеличаване на капитала; \r\n`,
		`\u200B4. назначава управителя, сключва договор с него, определя възнаграждението му и го освобождава от отговорност; \r\n`,
		`\u200B5. взема решение за откриване и закриване на клонове и участие в други дружества; \r\n`,
		`\u200B6. взема решение за придобиване и отчуждаване на недвижими имоти и вещни права върху тях; \r\n`,
		`\u200B7. взема решения за предявяване на искове на дружеството срещу Управителя; \r\n`,
		`\u200BЧл.13. За решенията си Едноличният собственик на капитала съставя и подписва протокол. \r\n`,
		`\u200BЧл.14. Договорите между Едноличния собственик на капитала и Дружеството, когато то се представлява от него, се сключват в писмена форма. \r\n`,
		`\u200BУправител\r\n`,
		`\u200BЧл.15.(1) Дружеството се управлява и представлява от Едноличния собственик на капитала лично или чрез назначен от него Управител. \r\n`,
		`\u200B(2) Управителят има право да извършва всички действия и сделки, които са свързани с дейността на Дружеството, да го представлява и да упълномощава други лица за извършване на определени действия. Управителят няма право да отчуждава и да обременява с тежести недвижими и движими имоти на дружеството, освен ако е специално упълномощен от Едноличния собственик на капитала с писмена заповед заведена с изходящ номер. \r\n`,
		`\u200BЧл.16.(1) В изпълнение на функциите си Управителят: \r\n`,
		`\u200B1. организира изпълнението на решенията на Едноличния собственик на капитала; \r\n`,
		`\u200B2. организира дейността на дружеството, осъществява оперативното му ръководство, осигурява стопанисването и опазването на неговото имущество; \r\n`,
		`\u200B3. сключва трудови договори със служителите на дружеството. \r\n`,
		`\u200B(2) Отношенията между Управителя и Едноличния собственик на капитала, които не са уредени с Учредителния акт, се уреждат с отделни писмени решения на Едноличния собственик на капитала с изходящ номер. \r\n`,
		`\u200BДружествени книги\r\n`,
		`\u200BЧл.17.(1) Дружеството води книга за дяловете и дивидентите, и протоколна книга за решенията на Едноличния собственик на капитала в електронен вариант. \r\n`,
		`\u200B(2) В книгата за дяловете се вписват размерът на дяловете, направените вноски и всички промени в тях. \r\n`,
		`\u200B(3) Управителят отговаря за редовното водене на дружествените книги. \r\n`,
		`\u200B(4) Всеки електронен документ, трябва да присъства на локално и поне още едно копие на друг носител. \r\n\r\n`,
		`\u200BV. ДРУГИ РАЗПОРЕДБИ\r\n`,
		`\u200BДивиденти\r\n`,
		`\u200BЧл.18. Размерът на дивидентите се определя от Едноличния собственик на капитала. Изплащането им се удостоверява с разписка, която се прилага в книгата за дяловете и дивидентите. \r\n`,
		`\u200BПрекратяване на дружеството\r\n`,
		`\u200BЧл.19. Дружеството се прекратява със смъртта на Едноличния собственик на капитала, ако наследниците не поискат да продължат дейността или при издадена заповед за прекратяване на дружеството от Едноличния собственик. \r\n`,
		`\u200BЛиквидация на дружеството\r\n`,
		`\u200BЧл.20. Ликвидацията на дружеството се извършва по реда на глава седемнадесета от Търговския закон. \r\n`,
		`\u200BЧл.21. За неуредените с този договор въпроси се прилагат разпоредбите на Търговския закон. \r\n\r\n`,
		`\u200BТози договор се състави и подписа в два еднообразни екземпляра - един за Агенция по впистванията и един за Едноличния собственик на капитала.`,
		`\u200B\r\nДата: ${input.date_of_document} г.                                                Едноличен Собственик на капитала:......................................`,
		`\u200B                                                                                                                                                                 /Подпис/ \r\n`,
        ]
    }; 

    makePDF(docDefinition,"BGDok-ЕООД-УЧРЕДИТЕЛЕН-АКТ-НА-ЕДНОЛИЧНО-ДРУЖЕСТВО-С-ОГРАНИЧЕНА-ОТГОВОРНОСТ"); 

}

function getProtocolDoc(formSelector) {
    var input = objectifyForm(formSelector); 
    var docDefinition = {
        content: [
        {
            text: `ПРОТОКОЛ\r\n\r\nот\r\nЕдноличния Собственик на капитала\r\n\r\n`,
            style: 'title'
        },
        `\u200B\t\t\t\tДнес, ${input.date_of_document} г. в гр.София, аз – ${input.first_name} ${input.middle_name} ${input.last_name}, ЕГН ${input.pin_egn}, лична карта № ${input.user_id_number}, издадена на ${input.card_issue_date} г. и валидна до ${input.card_valid_date} г. от МВР – гр ${input.card_issuer_city} на основание чл. 113 от ТЗ взех решение за образуване на Еднолично дружество с ограничена отговорност “ ${input.company_name} ” ЕООД проведох първото редовно заседание на дружеството и \r\n\r\n`,
		        {
            text: `РЕШИХ\r\n\r\n`,
            style: 'title'
        },
		`\u200B\t\t1.Образувам еднолично дружество с ограничена отговорност “ ${input.company_name} ”/ ЕООД / по смисъла на чл.113 от ТЗ с:\r\n`,
		`\u200B\t\t\t- НАИМЕНОВАНИЕ: ${input.company_name} ЕООД , изписва се и на латиница като “ ${input.company_name_latin} ” \r\n`,
		`\u200B\t\t\t- СЕДАЛИЩЕ и АДРЕС НА УПРАВЛЕНИЕ - гр. ${input.company_address_city} , район ${input.company_address_neighborhood} , ул. “ ${input.company_address_street} ” № ${input.company_address_street_number} .\r\n`,
		`\u200B\t\t\t- ПРЕДМЕТ НА ДЕЙНОСТ - ${input.company_purpose} .\r\n`,
		`\u200B\t\t\t- КАПИТАЛ - в размер на ${input.company_capital} / ${input.company_capital_text} / лева, разпределен на ${input.company_share_count} / ${input.company_share_count_text} / дяла по ${input.company_share_cost} / ${input.company_share_cost_text} / лев единия, като към момента на учредяване на дружеството са внесени ${input.company_capital_banked_percentage} / ${input.company_capital_banked_percentage_text} / % - ${input.company_capital_banked} / ${input.company_capital_banked_text} лева/.\r\n`,
		`\u200B\t\t2.Приемам изцяло приложения и подписан от мен Учредителен акт/Устав/ на дружеството.\r\n`,
		`\u200B\t\t3.Дружеството ще се управлява и представлява от мен - едноличния собственик на капитала или управителя на дружеството.\r\n`,
		`\u200B\t\t4.Да предприема необходимите действия за вписване в агенция по вписванията.\r\n`,
		`\r\n\r\n\r\n\u200B\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tЕдноличен собственик на капитала: /....................................................../`,
		`\u200B\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t                                                                         /Подпис/`,
        ]
    }; 

    makePDF(docDefinition,"BGDok-ЕООД-Протокол-от-Едноличния-Собственик-на-капитала"); 

}

function getSample141(formSelector) {
    var input = objectifyForm(formSelector); 
    var docDefinition = {
        content: [
        {
            text: `СЪГЛАСИЕ С ОБРАЗЕЦ ОТ ПОДПИС\r\n\r\nпо чл. 141, ал. 3 от Търговския закон\r\n\r\n\r\n`,
            style: 'title'
        },
        `\u200B\t\t\t\tДолуподписаният, ${input.first_name} ${input.middle_name} ${input.last_name} с ЕГН: ${input.pin_egn}, и адрес: област ${input.user_address_province}, община ${input.user_address_municipality}, гр ${input.user_address_city} , лична карта № ${input.user_id_number} , издадена на ${input.card_issue_date} г. от МВР ${input.card_issuer_city} , \r\n`,
		`\r\n`,
		`\r\n`,
		{
            text: `ДЕКЛАРИРАМ\r\n\r\n`,
            style: 'title'
        },
		`\u200B1. Съгласен съм и приемам да управлявам и представлявам Дружество с ограничена отговорност „ ${input.company_name} ” ЕООД със седалище и адрес на управление: гр. ${input.company_address_city} (област ${input.company_address_province}, община ${input.company_address_municipality}), ул. " ${input.company_address_street} " № ${input.company_address_street_number} \r\n\r\n`,
		`\u200B\r\n\r\n2. Подписвам се както следва:     ........................................................                ........................................................`,
		`\u200B                                                                                /Подпис/                                                             /Подпис/ \r\n\r\n\r\n\r\n`,
		`\u200B\r\nДата: ${input.date_of_document} г.                                                                              ДЕКЛАРАТОР:......................................`,
		`\u200B                                                                                                                                                     /Подпис/`,
        ]
    }; 

    makePDF(docDefinition,"BGDok-ЕООД-Образец-по-чл141-ал3-от-ТЗ"); 

}
